import { Link } from 'react-router-dom'
import logo from '../assets/icons/logo.svg'
import koinot_rason from '../assets/image/koinot_rason.png'
import Koinot_qwatt from '../assets/image/Koinot_qwatt.png'
import Koinot_global from '../assets/image/Koinot_global.png'
import Savora from '../assets/image/Savora.png'
import luckincofee from '../assets/image/luckincofee.png'
import underground from '../assets/image/underground.png'

function Our_projects(props) {
  return (
    <div className="projects__wrapper">
      <div className='projects__title'>
        <h1>Наши проекты</h1>
        <p>Мы развиваем диверсифицированный портфель бизнесов в разных отраслях — от цифровых сервисов до розничной сети и логистики. Каждое направление объединяет системный подход, технологичность и фокус на качестве.
        </p>
      </div>
      <div className='our__parnters'>
        <div className='img__bg'>
          <Link to='./koinot_rason'>
            <img src={koinot_rason} alt='our__parnters' />
            <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
            </svg>
          </Link>
        </div>
        <div className='img__bg'>
          <Link to='/koinot_qwatt'>
            <img src={Koinot_qwatt} alt='our__parnters' />
            <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
            </svg>
          </Link>
        </div>
        <div className='img__bg'>
          <img src={Koinot_global} alt='our__parnters' />
          <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
          </svg>
        </div>
        <div className='img__bg'>
          <img src={Savora} alt='our__parnters' />
          <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
          </svg>
        </div>
        <div className='img__bg'>
          <Link to='./luckin_cofee'>
            <img src={luckincofee} alt='our__parnters' />
            <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
            </svg>
          </Link>
        </div>
        <div className='img__bg'>
          <img src={underground} alt='our__parnters' />
          <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
          </svg>
        </div>
        <div className='img__bg'>
          <h1>LOGO</h1>
          <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
          </svg>
        </div>
        <div className='img__bg'>
          <h1>LOGO</h1>
          <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
          </svg>
        </div>
        <div className='img__bg'>
          <h1>LOGO</h1>
          <svg width="19" height="22" viewBox="0 0 19 22" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.79 0.858707C16.7118 0.311974 16.2053 -0.0679253 15.6586 0.0101793L6.74904 1.28297C6.2023 1.36108 5.8224 1.86761 5.90051 2.41434C5.97861 2.96108 6.48515 3.34098 7.03188 3.26287L14.9515 2.1315L16.0828 10.0511C16.161 10.5978 16.6675 10.9777 17.2142 10.8996C17.761 10.8215 18.1409 10.315 18.0627 9.76825L16.79 0.858707ZM0.800003 21.0001L1.6 21.6001L16.6 1.60013L15.8 1.00013L15 0.400129L3.03984e-06 20.4001L0.800003 21.0001Z" fill="black" />
          </svg>
        </div>
      </div>
    </div>
  )
}
export default Our_projects