import logo__savora from '../../assets/image/logo__savora.png';
import koinot_zapravka from '../../assets/image/koinot_zapravka.png';
function LandingPage_info() {
  return (
    <>
      <div className='savora__info'>
        <div className='savora__title'>
          <h1>автосервис нового  уровня</h1>
          <p>
            Savora объединяет на одной площадке все, что нужно автомобилью:
            ротбот-мойка, самомойку, замена масло и шиномонтаж, сушку под новесом и зарядку электромобилей.
          </p>
          <div className='savora__btn'>
            <button>
              Сайт Проекта
              <svg xmlns="http://w3.org" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round">
                <path d="M5 12h14"></path>
                <path d="M12 5l7 7-7 7"></path>
              </svg>
            </button>
            <button>
              Услуги комплексов
              <svg width="14" height="30" viewBox="0 0 14 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M8.7674 28.9L12.8403 24.0625C12.9379 23.9463 13.0154 23.808 13.0683 23.6557C13.1212 23.5034 13.1484 23.34 13.1484 23.175C13.1484 23.01 13.1212 22.8466 13.0683 22.6943C13.0154 22.542 12.9379 22.4037 12.8403 22.2875V22.2875C12.6451 22.0547 12.3811 21.924 12.1059 21.924C11.8307 21.924 11.5667 22.0547 11.3716 22.2875L7.63198 26.7375L7.63198 1.25C7.63198 0.918479 7.52223 0.600537 7.32688 0.366117C7.13153 0.131696 6.86658 0 6.59031 0V0C6.31405 0 6.0491 0.131696 5.85375 0.366117C5.65839 0.600537 5.54865 0.918479 5.54865 1.25L5.54865 26.8125L1.78823 22.2875C1.69139 22.1703 1.57619 22.0773 1.44925 22.0139C1.32231 21.9504 1.18616 21.9178 1.04865 21.9178C0.911136 21.9178 0.774984 21.9504 0.648048 22.0139C0.521111 22.0773 0.4059 22.1703 0.309064 22.2875C0.21143 22.4037 0.133936 22.542 0.0810524 22.6943C0.0281684 22.8466 0.000941818 23.01 0.000941818 23.175C0.000941818 23.34 0.0281684 23.5034 0.0810524 23.6557C0.133936 23.808 0.21143 23.9463 0.309064 24.0625L4.35073 28.9C4.93667 29.6023 5.73094 29.9967 6.55906 29.9967C7.38719 29.9967 8.18146 29.6023 8.7674 28.9V28.9Z" fill="black" />
              </svg>

            </button>
          </div>
        </div>
        <div className='savora__images'>
          <img src={logo__savora} className='main__images-1' alt='images-tjk' />
        </div>
      </div>
      <div className='savora__dsp'>
        <div className='dsp__title'>
          <h1>Описание Проекта</h1>
          <p>
            Savora - автокомплекс полного цикла ухода за автомобилем. Пять направлений работают на  одной территории с продуманной схемой движения:
            вы заежайте, получаете нужные услуги и выезжайте без лишних остановок, звонков и очередей у кассы.
          </p>
        </div>
        <div className='savora__subtitle'>
          <div>
            <h1>4</h1>
            <p>бокса обслуживания</p>
          </div>
          <div>
            <h1>4</h1>
            <p>поста сушки под навесом</p>
          </div>
          <div>
            <h1>5</h1>
            <p>зарядных станций ЗЗС</p>
          </div>
        </div>
      </div>
      <div className='savora__scooter'>
        <div className='scooter__title'>
          <h1>Всё на одной площадке</h1>
          <p>
            Здание с четырьмя боксами и ресепшном, навес сушки,
            зарядные станции у въезда и одностороннее движение по территории.
          </p>
        </div>
      </div>
      <div className='savora__img'>
        <img src={koinot_zapravka} alt="" />
        <h1>Услуги комплекса
        </h1>
        <p>
          Каждая зона Savora имеет свой цвет — его вы увидите на воротах боксов, на стеле и в приложении.
        </p>
      </div>
    </>
  )
}
export default LandingPage_info